system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;//0.01;

vertices
(
    ( 0  0  0)
    ( 3  0  0)
    ( 3  3  0)
    ( 0  3  0)
    ( 0  0  1)
    ( 3  0  1)
    ( 3  3  1)
    ( 0  3  1)

    ( 0.75  0.75  0)
    ( 1.25  0.75  0)
    ( 1.25  1.25  0)
    ( 0.75  1.25  0)
    ( 0.75  0.75  1)
    ( 1.25  0.75  1)
    ( 1.25  1.25  1)
    ( 0.75  1.25  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 200 1) simpleGrading (1 1 1)

    hex (8 9 10 11 12 13 14 15) movingZone (50 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oversetzao
    {
        type        overset;
        faces
        (
            ( 8 12 15 11)
            (10 14 13  9)
            (11 15 14 10)
            ( 9 13 12  8)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }

    // Populated by subsetMesh
    hole
    {
        type wall;
        faces ();
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            ( 8 11 10  9)
            (12 13 14 15)
        );
    }
);

// ************************************************************************* //
